cavityTest/liddrivencavity/64/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;  

startFrom       startTime;   
startTime       0;           

stopAt          endTime;     
endTime         100;         

deltaT          0.005;      

writeControl    timeStep;   
writeInterval   100;         

purgeWrite      0;           

writeFormat     ascii;    
writePrecision  6;          
writeCompression off;     

timeFormat      general;    
timePrecision   6;         
maxCo           0.5;         
runTimeModifiable yes;       

// ************************************************************************* //
