cavityTest/liddrivencavity/64/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes
{
    default         backward;  // Time derivative scheme (implicit backward scheme)
}

gradSchemes
{
    default         Gauss linear;  // Gradient scheme
    grad(U) 		Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linear;  // Convection term scheme for velocity
    div((nuEff*dev2(T(grad(U))))) Gauss linear; 
}

laplacianSchemes
{
    default         Gauss linear corrected;  // Laplacian scheme
}

interpolationSchemes
{
    default         linear;  // Interpolation scheme
}

snGradSchemes
{
    default         corrected;  // Surface-normal gradient scheme
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
